Repository: lawrancej/logisim
Catalog: xlate/ru/doc/omegat-logisim-doc_ru-omegat.tmx
Source language: en
Languages: ru_ru

source: The direction of the component (specifying which side has the outputs).
ru_ru: Направление компонента (определяющее, на какой стороне выходы).

source: (The order in which they are listed does not matter.)
ru_ru: (Порядок, в котором они перечислены, не имеет значения.)

source: There are a number of actions possible with this tool.
ru_ru: Есть ряд действий, возможных с помощью этого инструмента.

source: The pop-up menu for memory includes four options in addition to the options common to all components:
ru_ru: Всплывающее меню для памяти включает в себя четыре пункта, в дополнение к опциям, общим для всех компонентов:

source: The licenses for most software are designed to take away your freedom to share and change it.
ru_ru: Лицензии на большую часть программного обеспечения (ПО), составлены так, чтобы лишить вас свободы совместно использовать и изменять его.

source: If p-gate is 1 while p-gate is 0, then the connection is broken, so the value at drain is left floating.
ru_ru: Если на p-затворе 1, а на n-затворе 0, то соединение разрывается, и значение на стоке остаётся плавающим.

source: These correspond to errors that occurred while calculating the value for that row - either the circuit seemed to be oscillating, or the output value was an error value (which would be pictured as a red wire in the Logisim circuit).
ru_ru: Они соответствуют ошибкам, которые произошли при расчёте значения для этой строки - либо схема возбуждается, либо на выходе было значение ошибки (которое отображается в виде красного провода на схеме Logisim).

source: Address Bit Width
ru_ru: Разрядность адреса

source: Header: Text that should appear centered at the top of each page.
ru_ru: Заголовок: Текст, который должен появиться сверху по центру каждой страницы.

source: Some other people who have been particularly helpful:
ru_ru: Некоторые другие люди, которые были особенно полезны:

source: By default, Logisim will compute a way to add new wires so that no existing connections are lost during the move.
ru_ru: По умолчанию Logisim будет вычислять способ добавить новые провода так, чтобы никакие существующие соединения не рвались при перемещении.

source: Remove Vertex
ru_ru: Удалить вершину

source: East edge (output, bit width matches Data Bits attribute)
ru_ru: Восточный край (выход, разрядность соответствует атрибуту Биты данных)

source: Which components support labels are indicated in the 'Text Tool Behavior' section of their documentation.
ru_ru: Какие компоненты поддерживают метки, указано в разделе "Поведение Инструмента Текст" их документации.

source: If there are four or fewer inputs, a Karnaugh map corresponding to the variable will appear below the selector.
ru_ru: Если входов четыре или меньше, то ниже списка появится карта Карно, соответствующая выходной переменной.

source: If, however, you prefer that the subcircuit be drawn differently, you can select Edit Circuit Appearance from the Project menu, and Logisim's interface will switch from its regular layout-editing interface to an interface for drawing the circuit's appearance.
ru_ru: Однако, если вы предпочитаете, чтобы подсхема была отрисована по-другому, вы можете выбрать Редактировать внешний вид схемы из меню Проект, и Logisim переключится с привычного интерфейса редактирования чертежа на интерфейс для рисования внешнего вида схемы.

source: /** Updates the last clock observed, returning true if triggered.
ru_ru: /** Обновляет последнее наблюдаемое значение на тактовом входе, возвращая истину, если он сработал.

source: This is the same as above, except that there is no clock.
ru_ru: Это тоже самое, что и выше, но в данном варианте нет тактового входа.

source: After selecting the desired items in the selection, you can of course cut/copy/paste/delete/duplicate all the items via the Edit menu.
ru_ru: После выделения необходимых объектов, можно, конечно, вырезать/копировать/вставить/удалить/дублировать все объекты, через меню Правка.

source: // If it doesn't yet exist, then we'll set it up with our default
ru_ru: // Если оно ещё не существует, то мы установим его на наши

source: For an output pin, the attribute has no effect.
ru_ru: Для выходного контакта атрибут не влияет ни на что.

source: Logisim is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
ru_ru: Logisim распространяется в надежде, что он будет полезным, но БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ, даже без подразумеваемых гарантий КОММЕРЧЕСКОЙ ЦЕННОСТИ или ПРИГОДНОСТИ ДЛЯ ОПРЕДЕЛЕННОЙ ЦЕЛИ.

source: Logisim will draw a red rectangle around that address.
ru_ru: Logisim нарисует красный прямоугольник вокруг этого адреса.

source: However, if shaped gates are selected, then the gate will be drawn with wings to accommodate additional inputs beyond what the shape naturally accommodates.
ru_ru: Однако, если выбраны фигурные элементы, то элемент будет отрисован с крыльями, чтобы вместить дополнительные входы помимо тех, которые фигура может вместить естественным образом.

source: North edge (input, bit width 1)
ru_ru: Северный край (вход, разрядность равна 1)

source: Button
ru_ru: Кнопка

source: package com.cburch.gray; import java.awt.Color; import java.awt.Graphics; import java.awt.event.KeyEvent; import java.awt.event.MouseEvent; import com.cburch.logisim.data.BitWidth; import com.cburch.logisim.data.Bounds; import com.cburch.logisim.data.Value; import com.cburch.logisim.instance.InstancePainter; import com.cburch.logisim.instance.InstancePoker; import com.cburch.logisim.instance.InstanceState; import com.cburch.logisim.instance.StdAttr; /** When the user clicks a counter using the Poke Tool, a CounterPoker object
ru_ru: package com.cburch.gray; import java.awt.Color; import java.awt.Graphics; import java.awt.event.KeyEvent; import java.awt.event.MouseEvent; import com.cburch.logisim.data.BitWidth; import com.cburch.logisim.data.Bounds; import com.cburch.logisim.data.Value; import com.cburch.logisim.instance.InstancePainter; import com.cburch.logisim.instance.InstancePoker; import com.cburch.logisim.instance.InstanceState; import com.cburch.logisim.instance.StdAttr; /** Когда пользователь щёлкает на счётчике, используя Инструмент Нажатие, объект CounterPoker

source: You can manipulate the contents of memory using the Poke Tool, but the interface for this is severely limited by space constraints: For more than the simplest editing, you will probably find the integrated hex editor far more convenient.
ru_ru: Вы можете манипулировать содержимым памяти, используя Инструмент Нажатие, но интерфейс для этого серьёзно ограничен размерами: если вам нужно больше, чем простейшее редактирование, то вы, вероятно, найдёте встроенный шестнадцатеричный редактор гораздо более удобным.

source: As soon as you save it, the other project should automatically load the modified version immediately; but if it does not, you can right-click the library folder in the explorer pane and select Reload Library.
ru_ru: Как только вы её сохраните, другой проект сразу автоматически загрузит изменённую версию; но если этого не произошло, вы можете нажать правой кнопкой мыши на библиотеке в панели проводника и выбрать Перезагрузить библиотеку.

source: To specify this, select the selection tool () and click the background of the circuit's layout.
ru_ru: Чтобы задать это, выберите Инструмент Выбор () и щёлкните на заднем плане чертежа схемы.

source: The option is disabled by default.
ru_ru: По умолчанию опция отключена.

source: Move Down moves the currently selected item of the toolbar down/right one spot.
ru_ru: Сдвинуть вниз перемещает выбранный в данный момент элемент панели инструментов на одну позицию вниз/вправо.

source: Moves the currently displayed circuit one step up the list of circuits within the project, as displayed in the explorer pane.
ru_ru: Перемещает отображаемую в данный момент схему на одну позицию вверх в списке схем проекта, показанном в панели проводника.

source: This General Public License applies to most of the Free Software Foundation's software and to any other program whose authors commit to using it.
ru_ru: Эта Универсальная Общественная Лицензия применима к большей части ПО Фонда Свободного ПО и ко всем другим программам, чьи авторы принимают на себя обязательства ее использовать.

source: Parallel Load
ru_ru: Параллельная загрузка

source: When the component is selected or being added, Alt-2 through Alt-5 alter its Bit Width attribute.
ru_ru: Когда компонент выбран, или уже добавлен, комбинации от Alt-2 до Alt-5 меняют его атрибут Разрядность.

source: D Flip-Flop
ru_ru: D триггер

source: The Wiring library's splitter tool () allows you to accomplish this.
ru_ru: Инструмент Разветвитель из библиотеки Проводка () позволяет вам решить эту задачу.

source: Incidentally, a library technically contains tools, not components.
ru_ru: Кстати, технически библиотека содержит инструменты, а не компоненты.

source: Allows the label associated with the gate to be edited.
ru_ru: Позволяет редактировать привязанную к элементу метку.

source: The library's main job is to list the tools that are available through the library; most often, the tools are all tools to add the various components defined - that is, instances of the AddTool class working with different component factories.
ru_ru: Основная задача библиотеки - перечислить инструменты, доступные через библиотеку; чаще всего, все инструменты - это инструменты для добавления различных объявленных компонентов, то есть экземпляры класса AddTool, работающие с разными фабриками компонентов.

source: Guidelines
ru_ru: Указания

source: Hex Digit Display
ru_ru: Шестнадцатеричный индикатор

source: If the multiplicand, the multiplier, or the carry-in input contain some floating bits or some error bits, then the component will perform a partial multiplication.
ru_ru: Если множимое, множитель, или вход переноса содержат несколько плавающих битов или несколько битов с ошибкой, то компонент выполнит частичное умножение.

source: Pressing the mouse within an unselected component (but not at one of the component's wiring points) drops all components from the current selection and selects instead the component(s) containing the clicked location.
ru_ru: Нажатии мыши внутри невыделенного компонента (но не на одном из мест контакта компонента) удаляет все элементы из текущего выделения и выделяет компонент(ы), содержащий точку нажатия.

source: Wires are non-directional; that is, they carry values from either endpoint to the other.
ru_ru: Провода не направленные, то есть они передают значения из обеих своих конечных точек в другую.

source: Two data ports are provided - one on the west side for storing data, and another on the east side for loading data.
ru_ru: Предоставляются два порта данных - один на западном крае для записи данных, и другой на восточном крае для чтения данных.

source: First click on the OR tool (); then click where you want it.
ru_ru: Сначала щёлкните на инструменте Элемент ИЛИ (); затем щёлкните там, где вы хотите его поместить.

source: When the current row becomes full, the cursor moves to the following line, possibly scrolling all current rows up if the cursor was already in the bottom row.
ru_ru: Если текущая строка становится полной, то курсор перемещается на следующую строку, возможно прокручивая все текущие строки вверх, если курсор уже находился в нижнем ряду.

source: At the top is an indicator of whether file logging is in progress and a button for enabling or disabling it.
ru_ru: Наверху - индикатор того, ведётся ли в данный момент запись в файл, и кнопка для её включения или выключения.

source: Maximize (Zoom on MacOS)
ru_ru: Максимизировать (Zoom на MacOS)

source: You can, though, probe a wire by clicking it using the poke tool ().
ru_ru: Вы можете, однако, исследовать провод, щёлкнув на нём Инструментом Нажатие ().

source: In testing a large circuit, and for documenting a circuit's behavior, a log of past circuit behavior can be useful.
ru_ru: При тестировании больших схем и при документировании поведения схемы, может быть полезен журнал поведения схемы.

source: The Spring 2005 CS61C class at the University of California, Berkeley, which endured the beta versions of Logisim 2.0.
ru_ru: Выпуск весны 2005 CS61C Университета Калифорнии, Беркли, который выдержал бета-версии Logisim 2.0.

source: Pins that face south in the layout (typically toward the north side of the layout) will be placed on the rectangle's north side, according to the left-to-right ordering in the layout.
ru_ru: Контакты, направленные на юг на чертеже (и обычно расположенные на северной стороне чертежа) будут размещены на северной стороне прямоугольника в соответствии с их расположением слева направо на чертеже.

source: On the right top side is a rectangle in which you can click using the mouse combination you want to click.
ru_ru: Сверху правой стороны - прямоугольник, в котором вы можете щёлкнуть с комбинацией мыши, которая вам нужна.

source: Tutorial: Adding wires
ru_ru: Пособие: Добавление проводов

source: Each flip-flop stores a single bit of data, which is emitted through the Q output on the east side.
ru_ru: Каждый триггер хранит один бит данных, который выдаётся на выход Q на восточном крае.

source: // Now compute the output.
ru_ru: // Теперь вычислим значение на выходе.

source: THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE PROGRAM IS WITH YOU.
ru_ru: ВЕСЬ РИСК В ОТНОШЕНИИ КАЧЕСТВА И ПРОИЗВОДИТЕЛЬНОСТИ ПРОГРАММЫ ОСТАЕТСЯ ПРИ ВАС.

source: Logisim has no limits on how deeply circuits can be nested - though it will object to nesting circuits within themselves!
ru_ru: Logisim не имеет ограничения на то, насколько глубоко вложенными могут быть схемы - хотя он будет возражать против вложения схем внутрь себя.

source: When diagrammed, the source input and drain output are drawn connected by two plates; Logisim draws an arrowhead to indicate the direction of flow from input to output.
ru_ru: На схемах вход исток и выход сток изображаются соединёнными двумя пластинами; Logisim отрисовывает стрелку, указывающую направление потока от входа к выходу.

source: A more complete description of splitters is found in the `Splitters' section of the User's Guide.
ru_ru: Более полное описание разветвителя можно найти в разделе "Разветвители" Руководства пользователя.

source: The component's gate input.
ru_ru: Вход затвор компонента.

source: If the changes affect any of the subcircuit's outputs, they are propagated into the containing circuit.
ru_ru: Если изменения затрагивают любые выходы подсхемы, они распространяются в содержащую её схему.

source: * subclass of InstancePoker in the com.cburch.logisim.instance package.
ru_ru: * подклассом InstancePoker из пакета com.cburch.logisim.instance.

source: Trigger
ru_ru: Срабатывание

source: Typing hexadecimal digits will change the value at the address currently being edited.
ru_ru: Ввод шестнадцатеричных цифр будет изменять значение по редактируемому адресу.

source: Adding text to the circuit isn't necessary to make it work; but if you want to show your circuit to somebody (like a teacher), then some labels help to communicate the purpose of the different pieces of your circuit.
ru_ru: Добавления текста в схему не требуется, чтобы она работала, но если вы хотите показать вашу схему кому-то (например, преподавателю), то несколько меток помогут сообщить назначение разных частей вашей схемы.

source: AND/OR/NAND/NOR Gate
ru_ru: Элементы И/ИЛИ/И-НЕ/ИЛИ-НЕ

source: (This was Logisim's default behavior prior to Logisim 2.3.0.
ru_ru: (Это было поведение Logisim по умолчанию до Logisim 2.3.0.

source: Selects the color of a pixel when it is dim.
ru_ru: Определяет цвет потушенных пикселей.

source: I suggest building a circuit by inserting the gates first as a sort of skeleton and then connecting them with wires later.
ru_ru: Я предлагаю строить схему, добавляя сначала элементы, как своего рода каркас, а потом соединять их проводами.

source: Logisim will not permit you to unload any libraries currently being used, including libraries containing components appearing in any project circuits, as well as those with tools that appear in the toolbar or that are mapped to the mouse.
ru_ru: Logisim не разрешит вам выгрузить библиотеки, используемые в данный момент, включая библиотеки, содержащие компоненты, находящиеся в схеме проекта, или содержащие инструменты, присутствующие в панели инструментов, или привязанные к мыши.

source: When the clock input is triggered, the leftmost character disappears from the buffer and the new leftmost character is sent on the rightmost output.
ru_ru: Когда срабатывает тактовый вход, крайний левый символ исчезает из буфера и новый левый символ поступает на крайний правый выход.

source: The green circle with a line coming out of it, which we'll call the anchor. There is exactly one anchor in each subcircuit appearance.
ru_ru: Зеленый круг с линией, выходящей из него, который мы будем называть якорем. Существует ровно один якорь во внешнем виде каждой подсхемы.

source: Indicates how many pixels long the wire is.
ru_ru: Показывает длину этого провода в пикселях.

source: Library Reference
ru_ru: Справка по библиотеке

source: So that a script can process the file at the same time as Logisim is running, Logisim will flush the new records onto the disk every 500 ms.
ru_ru: Поскольку скрипт может обрабатывать файл в то время, когда Logisim запущен, Logisim сбрасывает новые записи на диск каждые 500 мс.

source: The tick rate is measured by averaging over the previous 1,000 ticks.
ru_ru: Скорость тактов измеряется как средняя за предыдущую 1000 тактов.

source: The component's output on the south edge indicates whether the desired bit was found at all.
ru_ru: Выход компонента на южном крае показывает, был ли желаемый бит вообще найден.

source: 7-Segment Display
ru_ru: 7-сегментный индикатор

source: The bit width of the value stored in each stage.
ru_ru: Разрядность значений, хранящихся в каждой ступени.

source: Enable: The component is enabled when this input is disconnected or 1; but if it is 0, then the clock input is ignored.
ru_ru: Включение: компонент включен, когда этот вход не подключен, или на нём 1; но когда на нём 0, тактовый вход игнорируется.

source: If it's being transformed into a smaller bit width, it is simply truncated to keep the lowest-order bits.
ru_ru: Если оно преобразуется в меньшую разрядность, то оно просто обрезается так, чтобы оставались младшие биты.

source: This will not be a commitment: I will be happy to hear of your interest, and I will tell you whether I know of somebody who is working on it already, prepare a version for you to work with, and send you instructions.
ru_ru: Это не будет обязательством: я буду рад услышать о вашем интересе, скажу, не знаю ли я кого-то, кто уже работает над ним, подготовлю вам версию для работы, и пришлю вам инструкции.

source: The interface for modifying the attribute will depend on which attribute you are changing; in the case of the Label Font attribute, a dialog box will appear for selecting the new font; but some attributes (like Label) will allow you to edit the value as a text field, while others (like Label Location) will display a drop-down menu from which to select the value.
ru_ru: Интерфейс для изменения атрибута будет зависеть от того, какой атрибут вы меняете; в случае атрибута Шрифт метки появится диалоговое окно для выбора нового шрифта, но некоторые атрибуты (например, Метка) позволят вам изменить значение в текстовом поле, в то время как другие (например, Направление метки) отобразят выпадающее меню для выбора значения.

source: In other words, when this is 0, no value is emitted on the D output.
ru_ru: Иными словами, если на этом входе 0, то никакого значения не выдаётся на выход D.

source: The truth table for a NOT gate is the following.
ru_ru: Таблица истинности для элемента НЕ следующая.

source: Each component included in a library is defined by creating a subclass of InstanceFactory found in the com.cburch.logisim.instance package.
ru_ru: Каждый компонент, включенный в библиотеку, объявляется путём создания подкласса InstanceFactory, расположенного в пакете com.cburch.logisim.instance.

source: // for drawing, and we'll use those here.
ru_ru: // для отрисовки и мы будем использовать их здесь.

source: We build our testing circuit into a different file.
ru_ru: Мы сохраняем нашу проверяющую схему в отдельный файл.

source: out
ru_ru: выход

source: The Input/Output library includes components that are meant to correspond to typical components found in electronics for interfacing with a user.
ru_ru: Библиотека Ввод/вывод включает в себя компоненты, созданные как соответствия типичным электронным компонентам для взаимодействия с пользователем.

source: The order of the two pins on the box's west side correspond to the same top-down ordering from the subcircuit's design.
ru_ru: Порядок контактов на западной стороне коробки соответствует их порядку сверху вниз на чертеже подсхемы.

source: The text within the label associated with the tunnel.
ru_ru: Текст внутри метки, привязанной к тоннелю.

source: The first of the two values to be compared.
ru_ru: Одно из двух значений для сравнения.

source: The Guide to Being a Logisim User
ru_ru: Руководство "Как стать пользователем Logisim"

source: You are free to distribute any JARs you develop without restriction.
ru_ru: Вы можете свободно распространять любые разработанные вами JARы без ограничений.

source: A carry value to add into the product.
ru_ru: Значение переноса для добавления к произведению.

source: (If you find these tips irritating, you can disable them via the Preferences window's Layout tab.)
ru_ru: (Если вы находите эти подсказки раздражающими, вы можете отключить их через вкладку Чертёж окна Настройки.)

source: The text within the label associated with the gate.
ru_ru: Текст внутри метки, привязанной к элементу.

source: I find it useful to think of a demultiplexer as analogous to a railroad switch, controlled by the select input.
ru_ru: Я считаю полезным думать о демультиплексоре как об аналоге железнодорожной стрелки, управляемой выбирающим входом.

source: Logisim uses an algorithm of selecting several random points in each of the two objects and seeing if any point is also in the other object.
ru_ru: Logisim использует алгоритм, заключающийся в выборе нескольких случайных точек на каждом из двух объектов и проверке принадлежности другому объекту хотя бы одной из них.

source: South edge, fourth from left (input, bit width 1)
ru_ru: Южный край, четвёртый слева (вход, разрядность равна 1)

source: Every Logisim project is actually a library of circuits.
ru_ru: Каждый проект Logisim - фактически библиотека схем.

source: Even
ru_ru: Чётность

source: You can select the output expression you want to view and edit using the selector labeled "Output:" at the pane's top.
ru_ru: Вы можете выбрать выходное выражение, которое вы хотите просматривать и изменять, с помощью списка "Выход:" наверху вкладки.

source: Open...
ru_ru: Открыть...

source: The following example starts Logisim in its basic configuration.
ru_ru: Следующий пример запускает Logisim в его базовой конфигурации.

source: Now suppose we have two Logisim circuits that are supposed to do the same thing.
ru_ru: Теперь предположим, что у нас есть две схемы Logisim, которые должны делать одно и то же.

source: If yes, then the segments light when the corresponding input is 1.
ru_ru: Если да , то сегменты горят, когда значение на соответствующем входе 1.

source: *North edge, left pin (input, bit width 1)
ru_ru: *Северный край, левый контакт (вход, разрядность равна 1)
